Revit 2016 API
AnalyticalModelStick.SetMemberForces Method (MemberForces)
 Sets Member Forces to element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public void SetMemberForces(
	MemberForces memberForces
)
Visual Basic
Public Sub SetMemberForces ( _
	memberForces As MemberForces _
)
Visual C++
public:
void SetMemberForces(
	MemberForces^ memberForces
)
Parameters
memberForces
Type: Autodesk.Revit.DB.Structure.MemberForces
 End to which member forces will be added is defined by setting [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property in provided Member Forces object.
Remarks
 If element already have member forces defined for that end, newly provided values replace current one.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
AnalyticalModelStick Class
SetMemberForces Overload
Autodesk.Revit.DB.Structure Namespace